wegam/STM32F1xWOW/Examples/APP_HC/PC006V21.C
/******************** (C) COPYRIGHT 2008 STMicroelectronics ********************
* File Name          : PC001V21.c
* Author             : WOW
* Version            : V2.0.1
* Date               : 06/26/2017
* Description        : PC001V21层控制板.
********************************************************************************
* THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
* WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE TIME.
* AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY DIRECT,
* INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING FROM THE
* CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE CODING
* INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
*******************************************************************************/


//==========================================配置说明
//旋转驱动器分频 5000
//升降驱动器分频	5000




#ifdef PC006V21			//分检机控制板

#include "PC006V21.H"

#include	"stdio.h"			//用于printf
#include	"string.h"		//用于printf
#include	"stdarg.h"		//用于获取不确定个数的参数
#include	"stdlib.h"		//malloc动态申请内存空间

#include "SteepMotor.H"
#include "STM32_TIM.H"
#include "SWITCHID.H"
#include "STM32_WDG.H"
#include "STM32_EXTI.H"
#include "STM32_GPIO.H"
#include "STM32_PWM.H"
#include "STM32_SYS.H"
#include "STM32_SYSTICK.H"
#include "STM32_CAN.H"
#include "STM32F10x_BitBand.H"






SWITCHID_CONF SWITCHID;					//拔码开关结构体
PWM_TimDef		PWM_Tim;					//PWM控制脉冲结构体
SteepMotor_Def	SteepMotor;			//步进电机

u8 SwitchData	=	0;	//存储拔码开关最新地址，如果地址变化，再重新配置运行参数
u8 MotorUD		=	0;	//升降电机控制板标志，0-非升降电机控制，1-升降电机控制
u8 MotorRL		=	0;	//旋转电机控制板标志，0-非旋转电机控制板，1-旋转电机控制板
u8 SensorRL		=	0;	//传感器板标志，0-非旋转传感器板，1-旋转传感器板
u32	MotorTime	=	0;	//旋转电机测试运行时间

//u8	CANID	=	0;
u16 SYSTime=0;
//u16 data=0;
//u8 Flag=0;
u8 Sensor[4]	=	{0};	//4个传感器感应值存储区
u8 SensorON		=	0	;		//旋转电机控制板发来开启传感器采集命令BUFFER[0]=0XAF BUFFER[1]=0关，=1开，0--不采集信号，1-采集信号0.5ms主动上报
u32 SensorTime	=	0;
//=================================旋转电机相关变量
u8 PowerFag	=	0;
u8 PlusFlg						=	0;		//步进电机脉冲标志，一个上升沿计一个脉冲	
u8 RunToWindow				=	0;		//旋转到相应窗口 0-无，1-1号，2-2号，3-3号，4-4号
u8 StatusOfWindow			=	0;		//当时停止位置：0-未初始化，1-原点，2-2号窗口，3-3号窗口，4-4号窗口
u8 CMDOfWindow				=	0;		//运行到指定窗口命令
u16	RunFrequency			=	0;		//当前运行频率
u32 SteepCount				=	0;		//运行步数计数
u32 SteepNeedToRun		=	0;		//需要运行的总步数
#ifdef	TestModel
u8	CCWFlag		=	0;
u8	StartTest		=	0;
u32	TestTime	=	0;
#endif

CanRxMsg RxMessage;			//CAN接收 
//CanTxMsg TxMessage;			//CAN发送




/*******************************************************************************
*函数名		:	function
*功能描述	:	函数功能说明
*输入			: 
*输出			:	无
*返回值		:	无
*例程			:
*******************************************************************************/
void PC006V21_Configuration(void)
{
	
	SYS_Configuration();						//系统配置 STM32_SYS.H	
	PWM_OUT(TIM2,PWM_OUTChannel1,10,900);			//SYS-LED 5HZ 10%		SYSLED_FRQ
	SysTick_DeleymS(5000);					//SysTick延时nmS
	SysTick_DeleymS(5000);					//SysTick延时nmS
	SysTick_Configuration(1000);		//系统嘀嗒时钟配置72MHz,单位为uS----定时扫描PC006V21_Server
	
	SWITCHID_Configuration();				//拔码开关初始化及读数

	if(MotorUD)
	{		
		MotorUDBoard_Configuration();					//旋转电机控制板配置
		PWM_OUT(TIM2,PWM_OUTChannel1,SYSLED_FRQ,500);			//SYS-LED 1HZ 50%		SYSLED_FRQ
	}
	else if(SensorRL)
	{
		SensorRLBoard_Configuration();				//旋转控制传感器板配置
		PWM_OUT(TIM2,PWM_OUTChannel1,SYSLED_FRQ,500);			//SYS-LED 1HZ 50%		SYSLED_FRQ
	}
	else if(MotorRL)
	{		
		MotorRLBoard_Configuration();					//旋转电机控制板配置
		PWM_OUT(TIM2,PWM_OUTChannel1,SYSLED_FRQ,500);			//SYS-LED 1HZ 50%		SYSLED_FRQ
	}
	else
	{
		SysTick_Configuration(1000);					//系统嘀嗒时钟配置72MHz,单位为uS----定时扫描PC006V21_Server
		PWM_OUT(TIM2,PWM_OUTChannel1,5,900);			//SYS-LED 5HZ 10%		SYSLED_FRQ
	}
	
	
	IWDG_Configuration(1000);	//独立看门狗配置	Tout-超时复位时间，单位ms
	
}

/*******************************************************************************
*函数名		:	function
*功能描述	:	函数功能说明
*输入			: 
*输出			:	无
*返回值		:	无
*例程			:
*******************************************************************************/
void PC006V21_Server(void)
{
	CAN_test();				//CAN收发数据管理
	
	if(MotorUD)
	{
		MotorUDBoard_Server();		//传感器板服务程序
	}
	else if(SensorRL)
	{
		SensorRLBoard_Server();		//传感器板服务程序
	}	
	else if(MotorRL)
	{
		MotorRLBoard_Server();		//电机控制板服务程序
	}
	Switch_Server();			//检查拔码地址有无变更，如果变更，重新配置运行参数
}
//==============================================================================



/*******************************************************************************
*函数名			:	function
*功能描述		:	函数功能说明
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	
*******************************************************************************/
void SWITCHID_Configuration(void)			//拔码开关初始化及读数
{
	//SW6 ON表示与旋转相关的板
	//SW5 ON表示旋转电机控制板，OFF表示传感器板
	//	u8 MotorBD	=	0;		//旋转电机控制板标志，0-非电机控制板，1-电机控制板
	//	u8 SensorBD	=	0;		//传感器板标志，0-非传感器板，1-传感器板
	
	SWITCHID.NumOfSW	=	6;
	//SW1--PA4
	SWITCHID.SW1_PORT	=	GPIOA;
	SWITCHID.SW1_Pin	=	GPIO_Pin_4;
	//SW2--PA5
	SWITCHID.SW2_PORT	=	GPIOA;
	SWITCHID.SW2_Pin	=	GPIO_Pin_5;
	//SW3--PB12
	SWITCHID.SW3_PORT	=	GPIOB;
	SWITCHID.SW3_Pin	=	GPIO_Pin_12;
	//SW4--PB13
	SWITCHID.SW4_PORT	=	GPIOB;
	SWITCHID.SW4_Pin	=	GPIO_Pin_13;
	//SW5--PB14
	SWITCHID.SW5_PORT	=	GPIOB;
	SWITCHID.SW5_Pin	=	GPIO_Pin_14;
	//SW6--PB15
	SWITCHID.SW6_PORT	=	GPIOB;
	SWITCHID.SW6_Pin	=	GPIO_Pin_15;
	
	SWITCHID_Conf(&SWITCHID);		//
	SWITCHID_Read(&SWITCHID);		//
	
	SwitchData	=	(SWITCHID.nSWITCHID)&0x3F;
	
	//==========================升降电机控制板
	if(SWITCHID_DATA.SW6==1&&SWITCHID_DATA.SW5==1&&SWITCHID_DATA.SW4==0)
	{
		MotorUD		=	1;	//升降电机控制板标志，0-非升降电机控制，1-升降电机控制
	}
	//==========================旋转电机控制板
	if(SWITCHID_DATA.SW6==1&&SWITCHID_DATA.SW5==0&&SWITCHID_DATA.SW4==1)
	{
		MotorRL		=	1;		//旋转电机控制板标志，0-非电机控制板，1-电机控制板
	}
	//==========================旋转电机传感器板
	if(SWITCHID_DATA.SW6==1&&SWITCHID_DATA.SW5==0&&SWITCHID_DATA.SW4==0)
	{
		SensorRL	=	1;		//传感器板标志，0-非传感器板，1-传感器板	
	}
}
/*******************************************************************************
*函数名			:	MotorBoard_Configuration
*功能描述		:	旋转电机控制板配置
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	
*******************************************************************************/
void MotorUDBoard_Configuration(void)		//旋转电机控制板配置
{
	//============================GPIO配置
	//电机控制板：	PA6-脉冲输出，PA7-方向控制输出
	//传感器板：		PA6，PA7做传感器指示灯（采集信号时闪烁）
	//1）============================步进电机参数配置
	
