wegam/STM32F1xWOW/Examples/APP_HC/PC006V21.C
/*******************************************************************************
*函数名			:	function
*功能描述		:	函数功能说明
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	
*******************************************************************************/
void CAN_Server(void)			//CAN收发数据管理
{
	//SW6 ON表示与旋转相关的板
	//SW5 ON表示旋转电机控制板，OFF表示传感器板
	//CAN滤波器组使用 0x0A
	//传感器板CAN-ID为0x80
	//旋转电机控制板CAN-ID为0xC0
	//	u8 MotorBD	=	0;		//旋转电机控制板标志，0-非电机控制板，1-电机控制板
	//	u8 SensorBD	=	0;		//传感器板标志，0-非传感器板，1-传感器板
	
	//	u8 RunToWindow	=	0;		//旋转到相应窗口 0-无，1-1号，2-2号，3-3号，4-4号
	//	u8 SensorON		=	0	;		//旋转电机控制板发来开启传感器采集命令BUFFER[0]=0XAF BUFFER[1]=0关，=1开，0--不采集信号，1-采集信号0.5ms主动上报
	u8 status	=	0;		//CAN读取返回0表示无效
	
	if(SensorRL)															//传感器板---旋转电机开始运行时开始采集信号
	{
		status	=	CAN_RX_DATA(&RxMessage);									//检查CAN接收有无数据
		if(status	==	0)		//未接收到数据
		{
			return;
		}
		if(RxMessage.StdId	==	MotorRL_ID)							//旋转电机控制板发来数据
		{
			//传感器信号采集开关
			if(RxMessage.Data[0]==0xAF	&&	RxMessage.Data[1]==0x01)
			{				
				SensorON	=	1;		//旋转电机控制板发来开启传感器采集命令BUFFER[0]=0XAF BUFFER[1]=0关，=1开，0--不采集信号，1-采集信号0.5ms主动上报
			}
			else if(RxMessage.Data[0]==0xAF	&&	RxMessage.Data[1]==0x00)
			{				
				SensorON	=	0;		//旋转电机控制板发来开启传感器采集命令BUFFER[0]=0XAF BUFFER[1]=0关，=1开，0--不采集信号，1-采集信号0.5ms主动上报
			}
			memset(RxMessage.Data,0x00,2);
		}
	}
	else if(MotorRL)				//旋转电机控制板
	{
		//	u8 RunToWindow	=	0;		//旋转到相应窗口 0-无，1-1号，2-2号，3-3号，4-4号
		status	=	CAN_RX_DATA(&RxMessage);									//检查CAN接收有无数据
		if(status	!=	0)		//接收到数据
		{
			if(RxMessage.StdId	==	Cmd_ID)							//旋转电机控制板接收到控制命令
			{
				if(RxMessage.Data[0]==0xFA	&&	RxMessage.Data[1]==0x55)	//运行到指定窗口命令
				{
					CMDOfWindow	=	RxMessage.Data[2];
				}	
			}
		}
		
		if(RunToWindow!=0	&&	SensorON!=1)			//电机在运转---需要传感器板返回传感器信号
		{
			Sensor[0]	=	0xAF;
			Sensor[1]	=	0x01;
			SensorON	=	1;
			CAN_StdTX_DATA(MotorRL_ID,2,Sensor);				//CAN使用标准帧发送数据
			memset(Sensor,0x00,2);
		}
		else if(RunToWindow==0	&&	SensorON!=0)				//电机停止运转---传感器板停止采集信号
		{
			Sensor[0]	=	0xAF;
			Sensor[1]	=	0x00;
			SensorON	=	0;
			CAN_StdTX_DATA(MotorRL_ID,2,Sensor);				//CAN使用标准帧发送数据
			memset(Sensor,0x00,2);
		}
	}
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	函数功能说明
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	
*******************************************************************************/
void CAN_test(void)			//CAN收发数据管理
{
	//SW6 ON表示与旋转相关的板
	//SW5 ON表示旋转电机控制板，OFF表示传感器板
	//CAN滤波器组使用 0x0A
	//传感器板CAN-ID为0x80
	//旋转电机控制板CAN-ID为0xC0
	//	u8 MotorBD	=	0;		//旋转电机控制板标志，0-非电机控制板，1-电机控制板
	//	u8 SensorBD	=	0;		//传感器板标志，0-非传感器板，1-传感器板
	
	//	u8 RunToWindow	=	0;		//旋转到相应窗口 0-无，1-1号，2-2号，3-3号，4-4号
	//	u8 SensorON		=	0	;		//旋转电机控制板发来开启传感器采集命令BUFFER[0]=0XAF BUFFER[1]=0关，=1开，0--不采集信号，1-采集信号0.5ms主动上报
	u8 status	=	0;		//CAN读取返回0表示无效
	SensorTime	++;
	
	if(SensorTime>=1000)
	{
		if(SensorRL)															//传感器板---旋转电机开始运行时开始采集信号
		{
			Sensor[0]=0x0F;
			Sensor[1]=0x0E;
			Sensor[2]=0x0A;
			Sensor[3]=0x0B;
			
			CAN_StdTX_DATA(SensorRL_ID,4,Sensor);			//CAN使用标准帧发送数据---发送传感器数据 0.5ms发送间隔
		}
		else if(MotorRL)															//传感器板---旋转电机开始运行时开始采集信号
		{
			Sensor[0]=0x0F;
			Sensor[1]=0x0E;
			Sensor[2]=0x0A;
			Sensor[3]=0x0B;
			
			CAN_StdTX_DATA(SensorRL_ID,4,Sensor);			//CAN使用标准帧发送数据---发送传感器数据 0.5ms发送间隔
		}
	}
	if(SensorRL)															//传感器板---旋转电机开始运行时开始采集信号
	{
		status	=	CAN_RX_DATA(&RxMessage);									//检查CAN接收有无数据
		if(status	==	0)		//未接收到数据
		{
			return;
		}
		if(RxMessage.StdId	==	MotorRL_ID)							//旋转电机控制板发来数据
		{
//			//传感器信号采集开关
//			if(RxMessage.Data[0]==0xAF	&&	RxMessage.Data[1]==0x01)
//			{				
//				SensorON	=	1;		//旋转电机控制板发来开启传感器采集命令BUFFER[0]=0XAF BUFFER[1]=0关，=1开，0--不采集信号，1-采集信号0.5ms主动上报
//			}
//			else if(RxMessage.Data[0]==0xAF	&&	RxMessage.Data[1]==0x00)
//			{				
//				SensorON	=	0;		//旋转电机控制板发来开启传感器采集命令BUFFER[0]=0XAF BUFFER[1]=0关，=1开，0--不采集信号，1-采集信号0.5ms主动上报
//			}
//			memset(RxMessage.Data,0x00,2);
			Sensor[0]=0x0F;
			Sensor[1]=0x0E;
			Sensor[2]=0x0A;
			Sensor[3]=0x0B;
			
			CAN_StdTX_DATA(SensorRL_ID,4,Sensor);			//CAN使用标准帧发送数据---发送传感器数据 0.5ms发送间隔
		}
	}
	else if(MotorRL)				//旋转电机控制板
	{

		status	=	CAN_RX_DATA(&RxMessage);									//检查CAN接收有无数据
		if(status	!=	0)		//接收到数据
		{
			if(RxMessage.StdId	==	Cmd_ID)							//旋转电机控制板接收到控制命令
			{
				if(RxMessage.Data[0]==0xFA	&&	RxMessage.Data[1]==0x55)	//运行到指定窗口命令
				{
					CMDOfWindow	=	RxMessage.Data[2];
				}	
			}
			else if(RxMessage.StdId	==	SensorRL_ID)							//旋转电机控制板接收到控制命令
			{
				Sensor[0]=0x0F;
				Sensor[1]=0x0E;
				Sensor[2]=0x0A;
				Sensor[3]=0x0B;
			
				CAN_StdTX_DATA(SensorRL_ID,4,Sensor);			//CAN使用标准帧发送数据---发送传感器数据 0.5ms发送间隔	
			}
		}
	}
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	函数功能说明
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	
*******************************************************************************/
void Switch_Server(void)			//检查拔码地址有无变更，如果变更，重新配置运行参数
{
	
	SWITCHID_Read(&SWITCHID);		//
	
	if((SWITCHID.nSWITCHID&0x3F)	!=	SwitchData)
	{
		Reset_Data();		//复位所有的全局变量值
		SwitchData	=	SWITCHID.nSWITCHID&0x3F;
		PC006V21_Configuration();
	}
	else if((SWITCHID.nSWITCHID&0x3F)	==	0x00)		//拨码未拨，循环配置
	{
		PC006V21_Configuration();
	}
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	函数功能说明
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	
*******************************************************************************/
void Reset_Data(void)		//复位所有的全局变量值
{
	SwitchData	=	0;	//存储拔码开关最新地址，如果地址变化，再重新配置运行参数
	SensorRL		=	0;	//传感器板标志，0-非旋转传感器板，1-旋转传感器板
	MotorRL		=	0;	//旋转电机控制板标志，0-非旋转电机控制板，1-旋转电机控制板
	MotorUD		=	0;	//升降电机控制板标志，0-非升降电机控制，1-升降电机控制
	MotorTime	=	0;	//旋转电机测试运行时间

	SYSTime=0;

	memset(Sensor,0x00,4);	//4个传感器感应值存储区
	SensorON		=	0	;				//旋转电机控制板发来开启传感器采集命令BUFFER[0]=0XAF BUFFER[1]=0关，=1开，0--不采集信号，1-采集信号0.5ms主动上报/电机控制板来储存是否开启传感器标志

	RunToWindow	=	0;				//旋转到相应窗口 0-无，1-1号，2-2号，3-3号，4-4号
	StatusOfWindow	=	0;		//当时停止位置：0-未初始化，1-原点，2-2号窗口，3-3号窗口，4-4号窗口
	CMDOfWindow	=	0;				//运行到指定窗口命令
}



#endif
